# Leen alharbi
----------------
day7-lab1-pandas

In [2]:
import numpy as np
import pandas as pd

## Q1: Create a Series with indexes = 1, 2, 3 and has three names.

In [3]:
s =pd.Series([1,2,3], index =["a","b","c"])
s

a    1
b    2
c    3
dtype: int64

## Q2: Change indexes to 11, 12, 13.

In [4]:
s.index = [11, 12, 13,]
s

11    1
12    2
13    3
dtype: int64

## Q3: Retrieve First and second elements.

In [6]:
s[0:2]

11    1
12    2
dtype: int64

## Q4: Add duplicate elements, then remove the duplication

In [7]:
s2 =pd.Series({14:2,15:3,})
s.append(s2)

11    1
12    2
13    3
14    2
15    3
dtype: int64

In [9]:
s.drop_duplicates()

11    1
12    2
13    3
dtype: int64

## Q5: Create a Students DataFrame has three columns (ID, Name)

In [31]:
data = {'ID': [111111,2222222,3333333],
        'Name': ['sara', 'loma', 'leen'],}


Students = pd.DataFrame(data,columns=['ID', 'Name',])
Students

        ID  Name
0   111111  sara
1  2222222  loma
2  3333333  leen

## Q6: Read educ_figdp_1_Data.csv file

In [29]:
read = pd.read_csv('educ_figdp_1_Data.csv')
read

,TIME,GEO,INDIC_ED,Value,Flag and Footnotes
0,2000,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
1,2001,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
2,2002,European Union (28 countries),Total public expenditure on education as % of ...,5.00,e
3,2003,European Union (28 countries),Total public expenditure on education as % of ...,5.03,e
4,2004,European Union (28 countries),Total public expenditure on education as % of ...,4.95,e
...,...,...,...,...,...
379,2007,Finland,Total public expenditure on education as % of ...,5.90,NaN
380,2008,Finland,Total public expenditure on education as % of ...,6.10,NaN
381,2009,Finland,Total public expenditure on education as % of ...,6.81,NaN
382,2010,Finland,Total public expenditure on education as % of ...,6.85,NaN
383,2011,Finland,Total public expenditure on education as % of ...,6.76,NaN

## Q7: What is the difference between loc and slicing?
- loc use the index labels as references
- slice use the position as references

loc is more explicit, especially when your columns are numbers